vegarwe/avr32/common/include/avr32/ioavr32.h
/**************************************************
 *
 * Declaration of system and registers for AVR32
 * IAR C/C++ Compiler and IAR Assembler.
 *  
 * Copyright 2005-2006 IAR Systems. All rights reserved.
 *
 * $Revision: 60652 $
 *
 **************************************************/

#ifndef __IOAVR32_H
#define __IOAVR32_H

#if (!__AAVR32__ && !__ICCAVR32__)
#error "File ioavr32.h is for use with ICCAVR32/AAVR32 only."
#endif

#include "avr32/abi.h"

#ifdef __ICCAVR32__
#pragma language=extended

/**************************************************
 *   System registers
 **************************************************/

typedef struct avr32_sr_t {
    unsigned int                 : 2;
    unsigned int h               : 1;
    unsigned int j               : 1;
    unsigned int dm              : 1;
    unsigned int d               : 1;
    unsigned int                 : 1;
    unsigned int m               : 3;
    unsigned int em              : 1;
    unsigned int i3m             : 1;
    unsigned int i2m             : 1;
    unsigned int i1m             : 1;
    unsigned int i0m             : 1;
    unsigned int gm              : 1;
    unsigned int r               : 1;
    unsigned int t               : 1;
    unsigned int                 : 8;
    unsigned int l               : 1;
    unsigned int q               : 1;
    unsigned int v               : 1;
    unsigned int n               : 1;
    unsigned int z               : 1;
    unsigned int c               : 1;
} avr32_sr_t;

#if __CORE__ == __AVR32A__
typedef struct avr32_cpucr_t {
    unsigned int                 :15;
    unsigned int locen           : 1;
    unsigned int spl             : 5;
    unsigned int cpl             : 5;
    unsigned int cop             : 5;
    unsigned int sie             : 1;
} avr32_cpucr_t;
#elif __CORE__ == __AVR32B__
typedef struct avr32_cpucr_t {
    unsigned int cop7en          : 1;
    unsigned int cop6en          : 1;
    unsigned int cop5en          : 1;
    unsigned int cop4en          : 1;
    unsigned int cop3en          : 1;
    unsigned int cop2en          : 1;
    unsigned int cop1en          : 1;
    unsigned int cop0en          : 1;
    unsigned int                 :17;
    unsigned int im              : 1;
    unsigned int iee             : 1;
    unsigned int ibe             : 1;
    unsigned int re              : 1;
    unsigned int fe              : 1;
    unsigned int be              : 1;
    unsigned int bi              : 1;
} avr32_cpucr_t;
#endif

typedef struct avr32_config0_t {
    unsigned int processorid     : 8;
    unsigned int                 : 4;
    unsigned int processorrevision : 4;
    unsigned int at              : 3;
    unsigned int ar              : 3;
    unsigned int mmut            : 3;
    unsigned int f               : 1;
    unsigned int j               : 1;
    unsigned int p               : 1;
    unsigned int o               : 1;
    unsigned int s               : 1;
    unsigned int d               : 1;
    unsigned int r               : 1;
} avr32_config0_t;

typedef struct avr32_config1_t {
    unsigned int immusz          : 6;
    unsigned int dmmusz          : 6;
    unsigned int iset            : 4;
    unsigned int ilsz            : 3;
    unsigned int iass            : 3;
    unsigned int dset            : 4;
    unsigned int dlsz            : 3;
    unsigned int dass            : 3;
} avr32_config1_t;

typedef struct avr32_tlbehi_t {
    unsigned int vpn             :22;
    unsigned int v               : 1;
    unsigned int i               : 1;
    unsigned int asid            : 8;
} avr32_tlbehi_t;

typedef struct avr32_tlbelo_t {
    unsigned int pfn             :22;
    unsigned int c               : 1;
    unsigned int g               : 1;
    unsigned int b               : 1;
    unsigned int ap              : 3;
    unsigned int sz              : 2;
    unsigned int d               : 1;
    unsigned int w               : 1;
} avr32_tlbelo_t;

typedef struct avr32_mmucr_t {
    unsigned int                 :12;
    unsigned int drp             : 6;
    unsigned int dla             : 6;
    unsigned int                 : 3;
    unsigned int s               : 1;
    unsigned int n               : 1;
    unsigned int i               : 1;
    unsigned int m               : 1;
    unsigned int e               : 1;
} avr32_mmucr_t;

typedef struct avr32_pccr_t {
    unsigned int                 : 8;
    unsigned int conf1           : 6;
    unsigned int conf0           : 6;
    unsigned int                 : 1;
    unsigned int f1              : 1;
    unsigned int f0              : 1;
    unsigned int fc              : 1;
    unsigned int                 : 1;
    unsigned int ie1             : 1;
    unsigned int ie0             : 1;
    unsigned int iec             : 1;
    unsigned int s               : 1;
    unsigned int c               : 1;
    unsigned int r               : 1;
    unsigned int e               : 1;
} avr32_pccr_t;

typedef struct avr32_mpuar_t {
    unsigned int base            :20;
    unsigned int                 : 6;
    unsigned int size            : 5;
    unsigned int v               : 1;
} avr32_mpuar_t;

typedef struct avr32_mpupsr_t {
    unsigned int                 :16;
    unsigned int p15             : 1;
    unsigned int p14             : 1;
    unsigned int p13             : 1;
    unsigned int p12             : 1;
    unsigned int p11             : 1;
    unsigned int p10             : 1;
    unsigned int p9              : 1;
    unsigned int p8              : 1;
    unsigned int p7              : 1;
    unsigned int p6              : 1;
    unsigned int p5              : 1;
    unsigned int p4              : 1;
    unsigned int p3              : 1;
    unsigned int p2              : 1;
    unsigned int p1              : 1;
    unsigned int p0              : 1;
} avr32_mpupsr_t;

