vegarwe/avr32/common/include/avr32/ioavr32.h
typedef struct avr32_mpucrx_t {
    unsigned int                 :24;
    unsigned int c7              : 1;
    unsigned int c6              : 1;
    unsigned int c5              : 1;
    unsigned int c4              : 1;
    unsigned int c3              : 1;
    unsigned int c2              : 1;
    unsigned int c1              : 1;
    unsigned int c0              : 1;
} avr32_mpucrx_t;

typedef struct avr32_mpubrx_t {
    unsigned int                 :24;
    unsigned int b7              : 1;
    unsigned int b6              : 1;
    unsigned int b5              : 1;
    unsigned int b4              : 1;
    unsigned int b3              : 1;
    unsigned int b2              : 1;
    unsigned int b1              : 1;
    unsigned int b0              : 1;
} avr32_mpubrx_t;

typedef struct avr32_mpuaprx_t {
    unsigned int ap7             : 4;
    unsigned int ap6             : 4;
    unsigned int ap5             : 4;
    unsigned int ap4             : 4;
    unsigned int ap3             : 4;
    unsigned int ap2             : 4;
    unsigned int ap1             : 4;
    unsigned int ap0             : 4;
} avr32_mpuaprx_t;

typedef struct avr32_mpucr_t {
    unsigned int                 :31;
    unsigned int e               : 1;
} avr32_mpucr_t;

#if __CORE__ == __AVR32A__
#define AVR32A(s) s
#define AVR32B(s) unsigned long : 32
#elif __CORE__ == __AVR32B__
#define AVR32A(s) unsigned long : 32
#define AVR32B(s) s
#else
#error "Unknown AVR32 core"
#endif

typedef struct avr32_core_t {
        /* 0x000 */
        union {
          unsigned long         sr;
          avr32_sr_t            SR;
        };
        unsigned long           evba;
        unsigned long           acba;
        union {
          unsigned long         cpucr;
          avr32_cpucr_t         CPUCR;
        };
        unsigned long     const ecr;

        /* 0x014 */
AVR32B (unsigned long           rsr_sup);
AVR32B (unsigned long           rsr_int0);
AVR32B (unsigned long           rsr_int1);
AVR32B (unsigned long           rsr_int2);
AVR32B (unsigned long           rsr_int3);
AVR32B (unsigned long           rsr_ex);
AVR32B (unsigned long           rsr_nmi);
        unsigned long           rsr_dbg;

        /* 0x034 */
AVR32B (unsigned long           rar_sup);
AVR32B (unsigned long           rar_int0);
AVR32B (unsigned long           rar_int1);
AVR32B (unsigned long           rar_int2);
AVR32B (unsigned long           rar_int3);
AVR32B (unsigned long           rar_ex);
AVR32B (unsigned long           rar_nmi);
        unsigned long           rar_dbg ;

        /* 0x054 */
        unsigned long     const jecr;
        unsigned long           josp;
        unsigned long           java_lv0;
        unsigned long           java_lv1;
        unsigned long           java_lv2;
        unsigned long           java_lv3;
        unsigned long           java_lv4;
        unsigned long           java_lv5;
        unsigned long           java_lv6;
        unsigned long           java_lv7;
        unsigned long           jtba;
        unsigned long           jbcr;

        /* 0x084 */
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;

        /* 0x0A0 */
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;

        /* 0x0C0 */
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;

        /* 0x0E0 */
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;
        unsigned long           : 32;

        /* 0x100 */
        union {
          unsigned long   const config0;
          avr32_config0_t const CONFIG0;
        };
        union {
          unsigned long   const config1;
          avr32_config1_t const CONFIG1;
        };

        /* 0x108 */
        unsigned long           count;
        unsigned long           compare;

        /* 0x110 */
        union {
          unsigned long         tlbehi;
          avr32_tlbehi_t        TLBEHI;
        };
        union {
          unsigned long         tlbelo;
          avr32_tlbelo_t        TLBELO;
        };
        unsigned long           ptbr;
        unsigned long     const tlbear;
        union {
          unsigned long         mmucr;
          avr32_mmucr_t         MMUCR;
        };
        unsigned long           tlbarlo;
        unsigned long           tlbarhi;

        /* 0x12C */
        unsigned long           pccnt;
        unsigned long           pcnt0;
        unsigned long           pcnt1;
        union {
          unsigned long         pccr;
          avr32_pccr_t          PCCR;
        };

        /* 0x13C */
        unsigned long     const bear;

        /* 0x140 */
        union {
          unsigned long         mpuar0;
          avr32_mpuar_t         MPUAR0;
        };
        union {
          unsigned long         mpuar1;
          avr32_mpuar_t         MPUAR1;
        };
        union {
          unsigned long         mpuar2;
          avr32_mpuar_t         MPUAR2;
        };
        union {
          unsigned long         mpuar3;
          avr32_mpuar_t         MPUAR3;
        };
        union {
          unsigned long         mpuar4;
          avr32_mpuar_t         MPUAR4;
        };
        union {
          unsigned long         mpuar5;
          avr32_mpuar_t         MPUAR5;
        };
        union {
          unsigned long         mpuar6;
          avr32_mpuar_t         MPUAR6;
        };
        union {
          unsigned long         mpuar7;
          avr32_mpuar_t         MPUAR7;
        };
        union {
          unsigned long         mpupsr0;
          avr32_mpupsr_t        MPUPSR0;
        };
        union {
          unsigned long         mpupsr1;
          avr32_mpupsr_t        MPUPSR1;
        };
        union {
          unsigned long         mpupsr2;
          avr32_mpupsr_t        MPUPSR2;
        };
        union {
          unsigned long         mpupsr3;
          avr32_mpupsr_t        MPUPSR3;
        };
        union {
          unsigned long         mpupsr4;
          avr32_mpupsr_t        MPUPSR4;
        };
        union {
          unsigned long         mpupsr5;
          avr32_mpupsr_t        MPUPSR5;
        };
        union {
          unsigned long         mpupsr6;
          avr32_mpupsr_t        MPUPSR6;
        };
        union {
          unsigned long         mpupsr7;
          avr32_mpupsr_t        MPUPSR7;
        };
        union {
          unsigned long         mpucra;
          avr32_mpucrx_t        MPUCRA;
        };
        union {
          unsigned long         mpucrb;
          avr32_mpucrx_t        MPUCRB;
        };
        union {
          unsigned long         mpubra;
          avr32_mpubrx_t        MPUBRA;
        };
        union {
          unsigned long         mpubrb;
          avr32_mpubrx_t        MPUBRB;
        };
        union {
          unsigned long         mpuapra;
          avr32_mpuaprx_t       MPUAPRA;
        };
        union {
          unsigned long         mpuaprb;
          avr32_mpuaprx_t       MPUAPRB;
        };
        union {
          unsigned long         mpucr;
          avr32_mpucr_t         MPUCR;
        };
} avr32_core_t;

extern __no_init __sysreg volatile avr32_core_t AVR32_CORE @ 0x000;

#pragma language=default
#endif  /* __IAR_SYSTEMS_ICC__  */

#define AVR32_CONFIG0_AR                                       10
#define AVR32_CONFIG0_AR_MASK                          0x00001c00
#define AVR32_CONFIG0_AR_OFFSET                                10
#define AVR32_CONFIG0_AR_SIZE                                   3
#define AVR32_CONFIG0_AT                                       13
#define AVR32_CONFIG0_AT_AVR32A                        0x00000000
#define AVR32_CONFIG0_AT_AVR32B                        0x00000001
#define AVR32_CONFIG0_AT_MASK                          0x0000e000
#define AVR32_CONFIG0_AT_OFFSET                                13
#define AVR32_CONFIG0_AT_SIZE                                   3
#define AVR32_CONFIG0_D                                         1
#define AVR32_CONFIG0_D_MASK                           0x00000002
#define AVR32_CONFIG0_D_OFFSET                                  1
#define AVR32_CONFIG0_D_SIZE                                    1
#define AVR32_CONFIG0_F                                         6
#define AVR32_CONFIG0_F_MASK                           0x00000040
#define AVR32_CONFIG0_F_OFFSET                                  6
#define AVR32_CONFIG0_F_SIZE                                    1
#define AVR32_CONFIG0_J                                         5
#define AVR32_CONFIG0_J_MASK                           0x00000020
#define AVR32_CONFIG0_J_OFFSET                                  5
#define AVR32_CONFIG0_J_SIZE                                    1
#define AVR32_CONFIG0_MMUT                                      7
#define AVR32_CONFIG0_MMUT_ITLB_DTLB                   0x00000001
#define AVR32_CONFIG0_MMUT_MASK                        0x00000380
#define AVR32_CONFIG0_MMUT_MPU                         0x00000003
#define AVR32_CONFIG0_MMUT_NONE                        0x00000000
#define AVR32_CONFIG0_MMUT_OFFSET                               7
#define AVR32_CONFIG0_MMUT_SHARED_TLB                  0x00000002
#define AVR32_CONFIG0_MMUT_SIZE                                 3
#define AVR32_CONFIG0_O                                         3
#define AVR32_CONFIG0_O_MASK                           0x00000008
#define AVR32_CONFIG0_O_OFFSET                                  3
#define AVR32_CONFIG0_O_SIZE                                    1
#define AVR32_CONFIG0_P                                         4
#define AVR32_CONFIG0_PROCESSORID                              24
#define AVR32_CONFIG0_PROCESSORID_AP7                  0x00000001
#define AVR32_CONFIG0_PROCESSORID_MASK                 0xff000000
#define AVR32_CONFIG0_PROCESSORID_OFFSET                       24
#define AVR32_CONFIG0_PROCESSORID_SIZE                          8
#define AVR32_CONFIG0_PROCESSORID_UC3                  0x00000002
#define AVR32_CONFIG0_PROCESSORREVISION                        16
#define AVR32_CONFIG0_PROCESSORREVISION_MASK           0x000f0000
#define AVR32_CONFIG0_PROCESSORREVISION_OFFSET                 16
#define AVR32_CONFIG0_PROCESSORREVISION_SIZE                    4
#define AVR32_CONFIG0_P_MASK                           0x00000010
#define AVR32_CONFIG0_P_OFFSET                                  4
#define AVR32_CONFIG0_P_SIZE                                    1
#define AVR32_CONFIG0_R                                         0
#define AVR32_CONFIG0_R_MASK                           0x00000001
#define AVR32_CONFIG0_R_OFFSET                                  0
#define AVR32_CONFIG0_R_SIZE                                    1
#define AVR32_CONFIG0_S                                         2
#define AVR32_CONFIG0_S_MASK                           0x00000004
#define AVR32_CONFIG0_S_OFFSET                                  2
#define AVR32_CONFIG0_S_SIZE                                    1

#define AVR32_CONFIG1_DASS                                      0
#define AVR32_CONFIG1_DASS_MASK                        0x00000007
#define AVR32_CONFIG1_DASS_OFFSET                               0
#define AVR32_CONFIG1_DASS_SIZE                                 3
#define AVR32_CONFIG1_DLSZ                                      3
#define AVR32_CONFIG1_DLSZ_MASK                        0x00000038
#define AVR32_CONFIG1_DLSZ_OFFSET                               3
#define AVR32_CONFIG1_DLSZ_SIZE                                 3
#define AVR32_CONFIG1_DMMUSZ                                   20
#define AVR32_CONFIG1_DMMUSZ_MASK                      0x03f00000
#define AVR32_CONFIG1_DMMUSZ_OFFSET                            20
#define AVR32_CONFIG1_DMMUSZ_SIZE                               6
#define AVR32_CONFIG1_DSET                                      6
#define AVR32_CONFIG1_DSET_MASK                        0x000003c0
#define AVR32_CONFIG1_DSET_OFFSET                               6
#define AVR32_CONFIG1_DSET_SIZE                                 4
#define AVR32_CONFIG1_IASS                                     10
#define AVR32_CONFIG1_IASS_MASK                        0x00001c00
#define AVR32_CONFIG1_IASS_OFFSET                              10
#define AVR32_CONFIG1_IASS_SIZE                                 3
#define AVR32_CONFIG1_ILSZ                                     13
#define AVR32_CONFIG1_ILSZ_MASK                        0x0000e000
#define AVR32_CONFIG1_ILSZ_OFFSET                              13
#define AVR32_CONFIG1_ILSZ_SIZE                                 3
#define AVR32_CONFIG1_IMMUSZ                                   26
#define AVR32_CONFIG1_IMMUSZ_MASK                      0xfc000000
#define AVR32_CONFIG1_IMMUSZ_OFFSET                            26
#define AVR32_CONFIG1_IMMUSZ_SIZE                               6
#define AVR32_CONFIG1_ISET                                     16
#define AVR32_CONFIG1_ISET_MASK                        0x000f0000
#define AVR32_CONFIG1_ISET_OFFSET                              16
#define AVR32_CONFIG1_ISET_SIZE                                 4

