vegarwe/avr32/common/include/avr32/ioavr32.h
#if __CORE__ == __AVR32A__
#define AVR32_CPUCR_COP                                         1
#define AVR32_CPUCR_COP_MASK                           0x0000003e
#define AVR32_CPUCR_COP_OFFSET                                  1
#define AVR32_CPUCR_COP_SIZE                                    5
#define AVR32_CPUCR_CPL                                         6
#define AVR32_CPUCR_CPL_MASK                           0x000007c0
#define AVR32_CPUCR_CPL_OFFSET                                  6
#define AVR32_CPUCR_CPL_SIZE                                    5
#define AVR32_CPUCR_LOCEN                                      16
#define AVR32_CPUCR_LOCEN_MASK                         0x00010000
#define AVR32_CPUCR_LOCEN_OFFSET                               16
#define AVR32_CPUCR_LOCEN_SIZE                                  1
#define AVR32_CPUCR_SIE                                         0
#define AVR32_CPUCR_SIE_MASK                           0x00000001
#define AVR32_CPUCR_SIE_OFFSET                                  0
#define AVR32_CPUCR_SIE_SIZE                                    1
#define AVR32_CPUCR_SPL                                        11
#define AVR32_CPUCR_SPL_MASK                           0x0000f800
#define AVR32_CPUCR_SPL_OFFSET                                 11
#define AVR32_CPUCR_SPL_SIZE                                    5
#elif __CORE__ == __AVR32B__
#define AVR32_CPUCR_BE                                          1
#define AVR32_CPUCR_BE_MASK                            0x00000002
#define AVR32_CPUCR_BE_OFFSET                                   1
#define AVR32_CPUCR_BE_SIZE                                     1
#define AVR32_CPUCR_BI                                          0
#define AVR32_CPUCR_BI_MASK                            0x00000001
#define AVR32_CPUCR_BI_OFFSET                                   0
#define AVR32_CPUCR_BI_SIZE                                     1
#define AVR32_CPUCR_COP0EN                                     24
#define AVR32_CPUCR_COP0EN_MASK                        0x01000000
#define AVR32_CPUCR_COP0EN_OFFSET                              24
#define AVR32_CPUCR_COP0EN_SIZE                                 1
#define AVR32_CPUCR_COP1EN                                     25
#define AVR32_CPUCR_COP1EN_MASK                        0x02000000
#define AVR32_CPUCR_COP1EN_OFFSET                              25
#define AVR32_CPUCR_COP1EN_SIZE                                 1
#define AVR32_CPUCR_COP2EN                                     26
#define AVR32_CPUCR_COP2EN_MASK                        0x04000000
#define AVR32_CPUCR_COP2EN_OFFSET                              26
#define AVR32_CPUCR_COP2EN_SIZE                                 1
#define AVR32_CPUCR_COP3EN                                     27
#define AVR32_CPUCR_COP3EN_MASK                        0x08000000
#define AVR32_CPUCR_COP3EN_OFFSET                              27
#define AVR32_CPUCR_COP3EN_SIZE                                 1
#define AVR32_CPUCR_COP4EN                                     28
#define AVR32_CPUCR_COP4EN_MASK                        0x10000000
#define AVR32_CPUCR_COP4EN_OFFSET                              28
#define AVR32_CPUCR_COP4EN_SIZE                                 1
#define AVR32_CPUCR_COP5EN                                     29
#define AVR32_CPUCR_COP5EN_MASK                        0x20000000
#define AVR32_CPUCR_COP5EN_OFFSET                              29
#define AVR32_CPUCR_COP5EN_SIZE                                 1
#define AVR32_CPUCR_COP6EN                                     30
#define AVR32_CPUCR_COP6EN_MASK                        0x40000000
#define AVR32_CPUCR_COP6EN_OFFSET                              30
#define AVR32_CPUCR_COP6EN_SIZE                                 1
#define AVR32_CPUCR_COP7EN                                     31
#define AVR32_CPUCR_COP7EN_MASK                        0x80000000
#define AVR32_CPUCR_COP7EN_OFFSET                              31
#define AVR32_CPUCR_COP7EN_SIZE                                 1
#define AVR32_CPUCR_FE                                          2
#define AVR32_CPUCR_FE_MASK                            0x00000004
#define AVR32_CPUCR_FE_OFFSET                                   2
#define AVR32_CPUCR_FE_SIZE                                     1
#define AVR32_CPUCR_IBE                                         4
#define AVR32_CPUCR_IBE_MASK                           0x00000010
#define AVR32_CPUCR_IBE_OFFSET                                  4
#define AVR32_CPUCR_IBE_SIZE                                    1
#define AVR32_CPUCR_IEE                                         5
#define AVR32_CPUCR_IEE_MASK                           0x00000020
#define AVR32_CPUCR_IEE_OFFSET                                  5
#define AVR32_CPUCR_IEE_SIZE                                    1
#define AVR32_CPUCR_IM                                          6
#define AVR32_CPUCR_IM_MASK                            0x00000040
#define AVR32_CPUCR_IM_OFFSET                                   6
#define AVR32_CPUCR_IM_SIZE                                     1
#define AVR32_CPUCR_RE                                          3
#define AVR32_CPUCR_RE_MASK                            0x00000008
#define AVR32_CPUCR_RE_OFFSET                                   3
#define AVR32_CPUCR_RE_SIZE                                     1
#endif

#define AVR32_ECR_ECR                                           0
#define AVR32_ECR_ECR_ADDR_ALIGN_R                     0x0000000d
#define AVR32_ECR_ECR_ADDR_ALIGN_W                     0x0000000e
#define AVR32_ECR_ECR_ADDR_ALIGN_X                     0x00000005
#define AVR32_ECR_ECR_BUS_ERROR_READ                   0x00000003
#define AVR32_ECR_ECR_BUS_ERROR_WRITE                  0x00000002
#define AVR32_ECR_ECR_COPROC_ABSENT                    0x0000000c
#define AVR32_ECR_ECR_DEBUG                            0x00000007
#define AVR32_ECR_ECR_DTLB_MODIFIED                    0x00000011
#define AVR32_ECR_ECR_FPE                              0x0000000b
#define AVR32_ECR_ECR_ILLEGAL_OPCODE                   0x00000008
#define AVR32_ECR_ECR_MASK                             0xffffffff
#define AVR32_ECR_ECR_NMI                              0x00000004
#define AVR32_ECR_ECR_OFFSET                                    0
#define AVR32_ECR_ECR_PRIVILEGE_VIOLATION              0x0000000a
#define AVR32_ECR_ECR_PROTECTION_R                     0x0000000f
#define AVR32_ECR_ECR_PROTECTION_W                     0x00000010
#define AVR32_ECR_ECR_PROTECTION_X                     0x00000006
#define AVR32_ECR_ECR_SIZE                                     32
#define AVR32_ECR_ECR_TLB_MISS_R                       0x00000018
#define AVR32_ECR_ECR_TLB_MISS_W                       0x0000001c
#define AVR32_ECR_ECR_TLB_MISS_X                       0x00000014
#define AVR32_ECR_ECR_TLB_MULTIPLE                     0x00000001
#define AVR32_ECR_ECR_UNIMPL_INSTRUCTION               0x00000009
#define AVR32_ECR_ECR_UNRECOVERABLE                    0x00000000

#define AVR32_MMUCR_DLA                                         8
#define AVR32_MMUCR_DLA_MASK                           0x00003f00
#define AVR32_MMUCR_DLA_OFFSET                                  8
#define AVR32_MMUCR_DLA_SIZE                                    6
#define AVR32_MMUCR_DRP                                        14
#define AVR32_MMUCR_DRP_MASK                           0x000fc000
#define AVR32_MMUCR_DRP_OFFSET                                 14
#define AVR32_MMUCR_DRP_SIZE                                    6
#define AVR32_MMUCR_E                                           0
#define AVR32_MMUCR_E_MASK                             0x00000001
#define AVR32_MMUCR_E_OFFSET                                    0
#define AVR32_MMUCR_E_SIZE                                      1
#define AVR32_MMUCR_I                                           2
#define AVR32_MMUCR_I_MASK                             0x00000004
#define AVR32_MMUCR_I_OFFSET                                    2
#define AVR32_MMUCR_I_SIZE                                      1
#define AVR32_MMUCR_M                                           1
#define AVR32_MMUCR_M_MASK                             0x00000002
#define AVR32_MMUCR_M_OFFSET                                    1
#define AVR32_MMUCR_M_PRIVATE                          0x00000000
#define AVR32_MMUCR_M_SHARED                           0x00000001
#define AVR32_MMUCR_M_SIZE                                      1
#define AVR32_MMUCR_N                                           3
#define AVR32_MMUCR_N_MASK                             0x00000008
#define AVR32_MMUCR_N_OFFSET                                    3
#define AVR32_MMUCR_N_SIZE                                      1
#define AVR32_MMUCR_S                                           4
#define AVR32_MMUCR_S_MASK                             0x00000010
#define AVR32_MMUCR_S_OFFSET                                    4
#define AVR32_MMUCR_S_SIZE                                      1

#define AVR32_MPUAPRX_AP0                                       0
#define AVR32_MPUAPRX_AP0_MASK                         0x0000000f
#define AVR32_MPUAPRX_AP0_OFFSET                                0
#define AVR32_MPUAPRX_AP0_PRIV_NONE_UNPRIV_NONE        0x0000000a
#define AVR32_MPUAPRX_AP0_PRIV_RWX_UNPRIV_NONE         0x00000003
#define AVR32_MPUAPRX_AP0_PRIV_RWX_UNPRIV_RWX          0x00000007
#define AVR32_MPUAPRX_AP0_PRIV_RW_UNPRIV_NONE          0x00000002
#define AVR32_MPUAPRX_AP0_PRIV_RW_UNPRIV_R             0x00000008
#define AVR32_MPUAPRX_AP0_PRIV_RW_UNPRIV_RW            0x00000006
#define AVR32_MPUAPRX_AP0_PRIV_RW_UNPRIV_RX            0x00000009
#define AVR32_MPUAPRX_AP0_PRIV_RX_UNPRIV_NONE          0x00000001
#define AVR32_MPUAPRX_AP0_PRIV_RX_UNPRIV_RX            0x00000005
#define AVR32_MPUAPRX_AP0_PRIV_R_UNPRIV_NONE           0x00000000
#define AVR32_MPUAPRX_AP0_PRIV_R_UNPRIV_R              0x00000004
#define AVR32_MPUAPRX_AP0_SIZE                                  4
#define AVR32_MPUAPRX_AP1                                       4
#define AVR32_MPUAPRX_AP1_MASK                         0x000000f0
#define AVR32_MPUAPRX_AP1_OFFSET                                4
#define AVR32_MPUAPRX_AP1_PRIV_NONE_UNPRIV_NONE        0x0000000a
#define AVR32_MPUAPRX_AP1_PRIV_RWX_UNPRIV_NONE         0x00000003
#define AVR32_MPUAPRX_AP1_PRIV_RWX_UNPRIV_RWX          0x00000007
#define AVR32_MPUAPRX_AP1_PRIV_RW_UNPRIV_NONE          0x00000002
#define AVR32_MPUAPRX_AP1_PRIV_RW_UNPRIV_R             0x00000008
#define AVR32_MPUAPRX_AP1_PRIV_RW_UNPRIV_RW            0x00000006
#define AVR32_MPUAPRX_AP1_PRIV_RW_UNPRIV_RX            0x00000009
#define AVR32_MPUAPRX_AP1_PRIV_RX_UNPRIV_NONE          0x00000001
#define AVR32_MPUAPRX_AP1_PRIV_RX_UNPRIV_RX            0x00000005
#define AVR32_MPUAPRX_AP1_PRIV_R_UNPRIV_NONE           0x00000000
#define AVR32_MPUAPRX_AP1_PRIV_R_UNPRIV_R              0x00000004
#define AVR32_MPUAPRX_AP1_SIZE                                  4
#define AVR32_MPUAPRX_AP2                                       8
#define AVR32_MPUAPRX_AP2_MASK                         0x00000f00
#define AVR32_MPUAPRX_AP2_OFFSET                                8
#define AVR32_MPUAPRX_AP2_PRIV_NONE_UNPRIV_NONE        0x0000000a
#define AVR32_MPUAPRX_AP2_PRIV_RWX_UNPRIV_NONE         0x00000003
#define AVR32_MPUAPRX_AP2_PRIV_RWX_UNPRIV_RWX          0x00000007
#define AVR32_MPUAPRX_AP2_PRIV_RW_UNPRIV_NONE          0x00000002
#define AVR32_MPUAPRX_AP2_PRIV_RW_UNPRIV_R             0x00000008
#define AVR32_MPUAPRX_AP2_PRIV_RW_UNPRIV_RW            0x00000006
#define AVR32_MPUAPRX_AP2_PRIV_RW_UNPRIV_RX            0x00000009
#define AVR32_MPUAPRX_AP2_PRIV_RX_UNPRIV_NONE          0x00000001
#define AVR32_MPUAPRX_AP2_PRIV_RX_UNPRIV_RX            0x00000005
#define AVR32_MPUAPRX_AP2_PRIV_R_UNPRIV_NONE           0x00000000
#define AVR32_MPUAPRX_AP2_PRIV_R_UNPRIV_R              0x00000004
#define AVR32_MPUAPRX_AP2_SIZE                                  4
#define AVR32_MPUAPRX_AP3                                      12
#define AVR32_MPUAPRX_AP3_MASK                         0x0000f000
#define AVR32_MPUAPRX_AP3_OFFSET                               12
#define AVR32_MPUAPRX_AP3_PRIV_NONE_UNPRIV_NONE        0x0000000a
#define AVR32_MPUAPRX_AP3_PRIV_RWX_UNPRIV_NONE         0x00000003
#define AVR32_MPUAPRX_AP3_PRIV_RWX_UNPRIV_RWX          0x00000007
#define AVR32_MPUAPRX_AP3_PRIV_RW_UNPRIV_NONE          0x00000002
#define AVR32_MPUAPRX_AP3_PRIV_RW_UNPRIV_R             0x00000008
#define AVR32_MPUAPRX_AP3_PRIV_RW_UNPRIV_RW            0x00000006
#define AVR32_MPUAPRX_AP3_PRIV_RW_UNPRIV_RX            0x00000009
#define AVR32_MPUAPRX_AP3_PRIV_RX_UNPRIV_NONE          0x00000001
#define AVR32_MPUAPRX_AP3_PRIV_RX_UNPRIV_RX            0x00000005
#define AVR32_MPUAPRX_AP3_PRIV_R_UNPRIV_NONE           0x00000000
#define AVR32_MPUAPRX_AP3_PRIV_R_UNPRIV_R              0x00000004
#define AVR32_MPUAPRX_AP3_SIZE                                  4
#define AVR32_MPUAPRX_AP4                                      16
#define AVR32_MPUAPRX_AP4_MASK                         0x000f0000
#define AVR32_MPUAPRX_AP4_OFFSET                               16
#define AVR32_MPUAPRX_AP4_PRIV_NONE_UNPRIV_NONE        0x0000000a
#define AVR32_MPUAPRX_AP4_PRIV_RWX_UNPRIV_NONE         0x00000003
#define AVR32_MPUAPRX_AP4_PRIV_RWX_UNPRIV_RWX          0x00000007
#define AVR32_MPUAPRX_AP4_PRIV_RW_UNPRIV_NONE          0x00000002
#define AVR32_MPUAPRX_AP4_PRIV_RW_UNPRIV_R             0x00000008
#define AVR32_MPUAPRX_AP4_PRIV_RW_UNPRIV_RW            0x00000006
#define AVR32_MPUAPRX_AP4_PRIV_RW_UNPRIV_RX            0x00000009
#define AVR32_MPUAPRX_AP4_PRIV_RX_UNPRIV_NONE          0x00000001
#define AVR32_MPUAPRX_AP4_PRIV_RX_UNPRIV_RX            0x00000005
#define AVR32_MPUAPRX_AP4_PRIV_R_UNPRIV_NONE           0x00000000
#define AVR32_MPUAPRX_AP4_PRIV_R_UNPRIV_R              0x00000004
#define AVR32_MPUAPRX_AP4_SIZE                                  4
#define AVR32_MPUAPRX_AP5                                      20
#define AVR32_MPUAPRX_AP5_MASK                         0x00f00000
#define AVR32_MPUAPRX_AP5_OFFSET                               20
#define AVR32_MPUAPRX_AP5_PRIV_NONE_UNPRIV_NONE        0x0000000a
#define AVR32_MPUAPRX_AP5_PRIV_RWX_UNPRIV_NONE         0x00000003
#define AVR32_MPUAPRX_AP5_PRIV_RWX_UNPRIV_RWX          0x00000007
#define AVR32_MPUAPRX_AP5_PRIV_RW_UNPRIV_NONE          0x00000002
#define AVR32_MPUAPRX_AP5_PRIV_RW_UNPRIV_R             0x00000008
#define AVR32_MPUAPRX_AP5_PRIV_RW_UNPRIV_RW            0x00000006
#define AVR32_MPUAPRX_AP5_PRIV_RW_UNPRIV_RX            0x00000009
#define AVR32_MPUAPRX_AP5_PRIV_RX_UNPRIV_NONE          0x00000001
#define AVR32_MPUAPRX_AP5_PRIV_RX_UNPRIV_RX            0x00000005
#define AVR32_MPUAPRX_AP5_PRIV_R_UNPRIV_NONE           0x00000000
#define AVR32_MPUAPRX_AP5_PRIV_R_UNPRIV_R              0x00000004
#define AVR32_MPUAPRX_AP5_SIZE                                  4
#define AVR32_MPUAPRX_AP6                                      24
#define AVR32_MPUAPRX_AP6_MASK                         0x0f000000
#define AVR32_MPUAPRX_AP6_OFFSET                               24
#define AVR32_MPUAPRX_AP6_PRIV_NONE_UNPRIV_NONE        0x0000000a
#define AVR32_MPUAPRX_AP6_PRIV_RWX_UNPRIV_NONE         0x00000003
#define AVR32_MPUAPRX_AP6_PRIV_RWX_UNPRIV_RWX          0x00000007
#define AVR32_MPUAPRX_AP6_PRIV_RW_UNPRIV_NONE          0x00000002
#define AVR32_MPUAPRX_AP6_PRIV_RW_UNPRIV_R             0x00000008
#define AVR32_MPUAPRX_AP6_PRIV_RW_UNPRIV_RW            0x00000006
#define AVR32_MPUAPRX_AP6_PRIV_RW_UNPRIV_RX            0x00000009
#define AVR32_MPUAPRX_AP6_PRIV_RX_UNPRIV_NONE          0x00000001
#define AVR32_MPUAPRX_AP6_PRIV_RX_UNPRIV_RX            0x00000005
#define AVR32_MPUAPRX_AP6_PRIV_R_UNPRIV_NONE           0x00000000
#define AVR32_MPUAPRX_AP6_PRIV_R_UNPRIV_R              0x00000004
#define AVR32_MPUAPRX_AP6_SIZE                                  4
#define AVR32_MPUAPRX_AP7                                      28
#define AVR32_MPUAPRX_AP7_MASK                         0xf0000000
#define AVR32_MPUAPRX_AP7_OFFSET                               28
#define AVR32_MPUAPRX_AP7_PRIV_NONE_UNPRIV_NONE        0x0000000a
#define AVR32_MPUAPRX_AP7_PRIV_RWX_UNPRIV_NONE         0x00000003
#define AVR32_MPUAPRX_AP7_PRIV_RWX_UNPRIV_RWX          0x00000007
#define AVR32_MPUAPRX_AP7_PRIV_RW_UNPRIV_NONE          0x00000002
#define AVR32_MPUAPRX_AP7_PRIV_RW_UNPRIV_R             0x00000008
#define AVR32_MPUAPRX_AP7_PRIV_RW_UNPRIV_RW            0x00000006
#define AVR32_MPUAPRX_AP7_PRIV_RW_UNPRIV_RX            0x00000009
#define AVR32_MPUAPRX_AP7_PRIV_RX_UNPRIV_NONE          0x00000001
#define AVR32_MPUAPRX_AP7_PRIV_RX_UNPRIV_RX            0x00000005
#define AVR32_MPUAPRX_AP7_PRIV_R_UNPRIV_NONE           0x00000000
#define AVR32_MPUAPRX_AP7_PRIV_R_UNPRIV_R              0x00000004
#define AVR32_MPUAPRX_AP7_SIZE                                  4

#define AVR32_MPUAR_BASE                                       12
#define AVR32_MPUAR_BASE_MASK                          0xfffff000
#define AVR32_MPUAR_BASE_OFFSET                                12
#define AVR32_MPUAR_BASE_SIZE                                  20
#define AVR32_MPUAR_SIZE                                        1
#define AVR32_MPUAR_SIZE_MASK                          0x0000003e
#define AVR32_MPUAR_SIZE_OFFSET                                 1
#define AVR32_MPUAR_SIZE_SIZE                                   5
#define AVR32_MPUAR_V                                           0
#define AVR32_MPUAR_V_MASK                             0x00000001
#define AVR32_MPUAR_V_OFFSET                                    0
#define AVR32_MPUAR_V_SIZE                                      1

