vegarwe/avr32/common/include/avr32/ioavr32.h
#define AVR32_MPUBRX_B0                                         0
#define AVR32_MPUBRX_B0_MASK                           0x00000001
#define AVR32_MPUBRX_B0_OFFSET                                  0
#define AVR32_MPUBRX_B0_SIZE                                    1
#define AVR32_MPUBRX_B1                                         1
#define AVR32_MPUBRX_B1_MASK                           0x00000002
#define AVR32_MPUBRX_B1_OFFSET                                  1
#define AVR32_MPUBRX_B1_SIZE                                    1
#define AVR32_MPUBRX_B2                                         2
#define AVR32_MPUBRX_B2_MASK                           0x00000004
#define AVR32_MPUBRX_B2_OFFSET                                  2
#define AVR32_MPUBRX_B2_SIZE                                    1
#define AVR32_MPUBRX_B3                                         3
#define AVR32_MPUBRX_B3_MASK                           0x00000008
#define AVR32_MPUBRX_B3_OFFSET                                  3
#define AVR32_MPUBRX_B3_SIZE                                    1
#define AVR32_MPUBRX_B4                                         4
#define AVR32_MPUBRX_B4_MASK                           0x00000010
#define AVR32_MPUBRX_B4_OFFSET                                  4
#define AVR32_MPUBRX_B4_SIZE                                    1
#define AVR32_MPUBRX_B5                                         5
#define AVR32_MPUBRX_B5_MASK                           0x00000020
#define AVR32_MPUBRX_B5_OFFSET                                  5
#define AVR32_MPUBRX_B5_SIZE                                    1
#define AVR32_MPUBRX_B6                                         6
#define AVR32_MPUBRX_B6_MASK                           0x00000040
#define AVR32_MPUBRX_B6_OFFSET                                  6
#define AVR32_MPUBRX_B6_SIZE                                    1
#define AVR32_MPUBRX_B7                                         7
#define AVR32_MPUBRX_B7_MASK                           0x00000080
#define AVR32_MPUBRX_B7_OFFSET                                  7
#define AVR32_MPUBRX_B7_SIZE                                    1

#define AVR32_MPUCRX_C0                                         0
#define AVR32_MPUCRX_C0_MASK                           0x00000001
#define AVR32_MPUCRX_C0_OFFSET                                  0
#define AVR32_MPUCRX_C0_SIZE                                    1
#define AVR32_MPUCRX_C1                                         1
#define AVR32_MPUCRX_C1_MASK                           0x00000002
#define AVR32_MPUCRX_C1_OFFSET                                  1
#define AVR32_MPUCRX_C1_SIZE                                    1
#define AVR32_MPUCRX_C2                                         2
#define AVR32_MPUCRX_C2_MASK                           0x00000004
#define AVR32_MPUCRX_C2_OFFSET                                  2
#define AVR32_MPUCRX_C2_SIZE                                    1
#define AVR32_MPUCRX_C3                                         3
#define AVR32_MPUCRX_C3_MASK                           0x00000008
#define AVR32_MPUCRX_C3_OFFSET                                  3
#define AVR32_MPUCRX_C3_SIZE                                    1
#define AVR32_MPUCRX_C4                                         4
#define AVR32_MPUCRX_C4_MASK                           0x00000010
#define AVR32_MPUCRX_C4_OFFSET                                  4
#define AVR32_MPUCRX_C4_SIZE                                    1
#define AVR32_MPUCRX_C5                                         5
#define AVR32_MPUCRX_C5_MASK                           0x00000020
#define AVR32_MPUCRX_C5_OFFSET                                  5
#define AVR32_MPUCRX_C5_SIZE                                    1
#define AVR32_MPUCRX_C6                                         6
#define AVR32_MPUCRX_C6_MASK                           0x00000040
#define AVR32_MPUCRX_C6_OFFSET                                  6
#define AVR32_MPUCRX_C6_SIZE                                    1
#define AVR32_MPUCRX_C7                                         7
#define AVR32_MPUCRX_C7_MASK                           0x00000080
#define AVR32_MPUCRX_C7_OFFSET                                  7
#define AVR32_MPUCRX_C7_SIZE                                    1

#define AVR32_MPUCR_E                                           0
#define AVR32_MPUCR_E_MASK                             0x00000001
#define AVR32_MPUCR_E_OFFSET                                    0
#define AVR32_MPUCR_E_SIZE                                      1

#define AVR32_MPUPSR_P0                                         0
#define AVR32_MPUPSR_P0_MASK                           0x00000001
#define AVR32_MPUPSR_P0_OFFSET                                  0
#define AVR32_MPUPSR_P0_SIZE                                    1
#define AVR32_MPUPSR_P1                                         1
#define AVR32_MPUPSR_P10                                       10
#define AVR32_MPUPSR_P10_MASK                          0x00000400
#define AVR32_MPUPSR_P10_OFFSET                                10
#define AVR32_MPUPSR_P10_SIZE                                   1
#define AVR32_MPUPSR_P11                                       11
#define AVR32_MPUPSR_P11_MASK                          0x00000800
#define AVR32_MPUPSR_P11_OFFSET                                11
#define AVR32_MPUPSR_P11_SIZE                                   1
#define AVR32_MPUPSR_P12                                       12
#define AVR32_MPUPSR_P12_MASK                          0x00001000
#define AVR32_MPUPSR_P12_OFFSET                                12
#define AVR32_MPUPSR_P12_SIZE                                   1
#define AVR32_MPUPSR_P13                                       13
#define AVR32_MPUPSR_P13_MASK                          0x00002000
#define AVR32_MPUPSR_P13_OFFSET                                13
#define AVR32_MPUPSR_P13_SIZE                                   1
#define AVR32_MPUPSR_P14                                       14
#define AVR32_MPUPSR_P14_MASK                          0x00004000
#define AVR32_MPUPSR_P14_OFFSET                                14
#define AVR32_MPUPSR_P14_SIZE                                   1
#define AVR32_MPUPSR_P15                                       15
#define AVR32_MPUPSR_P15_MASK                          0x00008000
#define AVR32_MPUPSR_P15_OFFSET                                15
#define AVR32_MPUPSR_P15_SIZE                                   1
#define AVR32_MPUPSR_P1_MASK                           0x00000002
#define AVR32_MPUPSR_P1_OFFSET                                  1
#define AVR32_MPUPSR_P1_SIZE                                    1
#define AVR32_MPUPSR_P2                                         2
#define AVR32_MPUPSR_P2_MASK                           0x00000004
#define AVR32_MPUPSR_P2_OFFSET                                  2
#define AVR32_MPUPSR_P2_SIZE                                    1
#define AVR32_MPUPSR_P3                                         3
#define AVR32_MPUPSR_P3_MASK                           0x00000008
#define AVR32_MPUPSR_P3_OFFSET                                  3
#define AVR32_MPUPSR_P3_SIZE                                    1
#define AVR32_MPUPSR_P4                                         4
#define AVR32_MPUPSR_P4_MASK                           0x00000010
#define AVR32_MPUPSR_P4_OFFSET                                  4
#define AVR32_MPUPSR_P4_SIZE                                    1
#define AVR32_MPUPSR_P5                                         5
#define AVR32_MPUPSR_P5_MASK                           0x00000020
#define AVR32_MPUPSR_P5_OFFSET                                  5
#define AVR32_MPUPSR_P5_SIZE                                    1
#define AVR32_MPUPSR_P6                                         6
#define AVR32_MPUPSR_P6_MASK                           0x00000040
#define AVR32_MPUPSR_P6_OFFSET                                  6
#define AVR32_MPUPSR_P6_SIZE                                    1
#define AVR32_MPUPSR_P7                                         7
#define AVR32_MPUPSR_P7_MASK                           0x00000080
#define AVR32_MPUPSR_P7_OFFSET                                  7
#define AVR32_MPUPSR_P7_SIZE                                    1
#define AVR32_MPUPSR_P8                                         8
#define AVR32_MPUPSR_P8_MASK                           0x00000100
#define AVR32_MPUPSR_P8_OFFSET                                  8
#define AVR32_MPUPSR_P8_SIZE                                    1
#define AVR32_MPUPSR_P9                                         9
#define AVR32_MPUPSR_P9_MASK                           0x00000200
#define AVR32_MPUPSR_P9_OFFSET                                  9
#define AVR32_MPUPSR_P9_SIZE                                    1

#define AVR32_PCCR_C                                            2
#define AVR32_PCCR_CONF0                                       12
#define AVR32_PCCR_CONF0_ACACHE_HIT                    0x00000015
#define AVR32_PCCR_CONF0_ACACHE_MISS                   0x00000016
#define AVR32_PCCR_CONF0_BR_EXECUTED                   0x00000005
#define AVR32_PCCR_CONF0_BR_MISPREDICTED               0x00000006
#define AVR32_PCCR_CONF0_BTB_HIT                       0x00000017
#define AVR32_PCCR_CONF0_CACHE_ACCESS_CYC              0x00000013
#define AVR32_PCCR_CONF0_CACHE_ACCESS_OCC              0x00000012
#define AVR32_PCCR_CONF0_CACHE_STALL_CYC               0x00000011
#define AVR32_PCCR_CONF0_CACHE_STALL_OCC               0x00000010
#define AVR32_PCCR_CONF0_DCACHE_LINE_WB                0x00000014
#define AVR32_PCCR_CONF0_DCACHE_READ_MISS_CYC          0x0000000b
#define AVR32_PCCR_CONF0_DCACHE_READ_MISS_OCC          0x0000000a
#define AVR32_PCCR_CONF0_DCACHE_WBUFF_FULL_STALL_CYC   0x00000009
#define AVR32_PCCR_CONF0_DCACHE_WBUFF_FULL_STALL_OCC   0x00000008
#define AVR32_PCCR_CONF0_DHAZARD_STALL                 0x00000002
#define AVR32_PCCR_CONF0_DTLB_MISS                     0x00000004
#define AVR32_PCCR_CONF0_DUTLB_MISS                    0x00000019
#define AVR32_PCCR_CONF0_ICACHE_MISS                   0x00000000
#define AVR32_PCCR_CONF0_IFETCH_STALL                  0x00000001
#define AVR32_PCCR_CONF0_INSN_EXECUTED                 0x00000007
#define AVR32_PCCR_CONF0_ITLB_MISS                     0x00000003
#define AVR32_PCCR_CONF0_IUTLB_MISS                    0x00000018
#define AVR32_PCCR_CONF0_MASK                          0x0003f000
#define AVR32_PCCR_CONF0_OFFSET                                12
#define AVR32_PCCR_CONF0_RACCESS_CYC                   0x0000000f
#define AVR32_PCCR_CONF0_RACCESS_OCC                   0x0000000e
#define AVR32_PCCR_CONF0_SIZE                                   6
#define AVR32_PCCR_CONF0_WACCESS_CYC                   0x0000000d
#define AVR32_PCCR_CONF0_WACCESS_OCC                   0x0000000c
#define AVR32_PCCR_CONF1                                       18
#define AVR32_PCCR_CONF1_ACACHE_HIT                    0x00000015
#define AVR32_PCCR_CONF1_ACACHE_MISS                   0x00000016
#define AVR32_PCCR_CONF1_BR_EXECUTED                   0x00000005
#define AVR32_PCCR_CONF1_BR_MISPREDICTED               0x00000006
#define AVR32_PCCR_CONF1_BTB_HIT                       0x00000017
#define AVR32_PCCR_CONF1_CACHE_ACCESS_CYC              0x00000013
#define AVR32_PCCR_CONF1_CACHE_ACCESS_OCC              0x00000012
#define AVR32_PCCR_CONF1_CACHE_STALL_CYC               0x00000011
#define AVR32_PCCR_CONF1_CACHE_STALL_OCC               0x00000010
#define AVR32_PCCR_CONF1_DCACHE_LINE_WB                0x00000014
#define AVR32_PCCR_CONF1_DCACHE_READ_MISS_CYC          0x0000000b
#define AVR32_PCCR_CONF1_DCACHE_READ_MISS_OCC          0x0000000a
#define AVR32_PCCR_CONF1_DCACHE_WBUFF_FULL_STALL_CYC   0x00000009
#define AVR32_PCCR_CONF1_DCACHE_WBUFF_FULL_STALL_OCC   0x00000008
#define AVR32_PCCR_CONF1_DHAZARD_STALL                 0x00000002
#define AVR32_PCCR_CONF1_DTLB_MISS                     0x00000004
#define AVR32_PCCR_CONF1_DUTLB_MISS                    0x00000019
#define AVR32_PCCR_CONF1_ICACHE_MISS                   0x00000000
#define AVR32_PCCR_CONF1_IFETCH_STALL                  0x00000001
#define AVR32_PCCR_CONF1_INSN_EXECUTED                 0x00000007
#define AVR32_PCCR_CONF1_ITLB_MISS                     0x00000003
#define AVR32_PCCR_CONF1_IUTLB_MISS                    0x00000018
#define AVR32_PCCR_CONF1_MASK                          0x00fc0000
#define AVR32_PCCR_CONF1_OFFSET                                18
#define AVR32_PCCR_CONF1_RACCESS_CYC                   0x0000000f
#define AVR32_PCCR_CONF1_RACCESS_OCC                   0x0000000e
#define AVR32_PCCR_CONF1_SIZE                                   6
#define AVR32_PCCR_CONF1_WACCESS_CYC                   0x0000000d
#define AVR32_PCCR_CONF1_WACCESS_OCC                   0x0000000c
#define AVR32_PCCR_C_MASK                              0x00000004
#define AVR32_PCCR_C_OFFSET                                     2
#define AVR32_PCCR_C_SIZE                                       1
#define AVR32_PCCR_E                                            0
#define AVR32_PCCR_E_MASK                              0x00000001
#define AVR32_PCCR_E_OFFSET                                     0
#define AVR32_PCCR_E_SIZE                                       1
#define AVR32_PCCR_F0                                           9
#define AVR32_PCCR_F0_MASK                             0x00000200
#define AVR32_PCCR_F0_OFFSET                                    9
#define AVR32_PCCR_F0_SIZE                                      1
#define AVR32_PCCR_F1                                          10
#define AVR32_PCCR_F1_MASK                             0x00000400
#define AVR32_PCCR_F1_OFFSET                                   10
#define AVR32_PCCR_F1_SIZE                                      1
#define AVR32_PCCR_FC                                           8
#define AVR32_PCCR_FC_MASK                             0x00000100
#define AVR32_PCCR_FC_OFFSET                                    8
#define AVR32_PCCR_FC_SIZE                                      1
#define AVR32_PCCR_IE0                                          5
#define AVR32_PCCR_IE0_MASK                            0x00000020
#define AVR32_PCCR_IE0_OFFSET                                   5
#define AVR32_PCCR_IE0_SIZE                                     1
#define AVR32_PCCR_IE1                                          6
#define AVR32_PCCR_IE1_MASK                            0x00000040
#define AVR32_PCCR_IE1_OFFSET                                   6
#define AVR32_PCCR_IE1_SIZE                                     1
#define AVR32_PCCR_IEC                                          4
#define AVR32_PCCR_IEC_MASK                            0x00000010
#define AVR32_PCCR_IEC_OFFSET                                   4
#define AVR32_PCCR_IEC_SIZE                                     1
#define AVR32_PCCR_R                                            1
#define AVR32_PCCR_R_MASK                              0x00000002
#define AVR32_PCCR_R_OFFSET                                     1
#define AVR32_PCCR_R_SIZE                                       1
#define AVR32_PCCR_S                                            3
#define AVR32_PCCR_S_MASK                              0x00000008
#define AVR32_PCCR_S_OFFSET                                     3
#define AVR32_PCCR_S_SIZE                                       1

