vegarwe/avr32/common/include/avr32/ioavr32.h
#define AVR32_SR_C                                              0
#define AVR32_SR_C_MASK                                0x00000001
#define AVR32_SR_C_OFFSET                                       0
#define AVR32_SR_C_SIZE                                         1
#define AVR32_SR_D                                             26
#define AVR32_SR_DM                                            27
#define AVR32_SR_DM_MASK                               0x08000000
#define AVR32_SR_DM_OFFSET                                     27
#define AVR32_SR_DM_SIZE                                        1
#define AVR32_SR_D_MASK                                0x04000000
#define AVR32_SR_D_OFFSET                                      26
#define AVR32_SR_D_SIZE                                         1
#define AVR32_SR_EM                                            21
#define AVR32_SR_EM_MASK                               0x00200000
#define AVR32_SR_EM_OFFSET                                     21
#define AVR32_SR_EM_SIZE                                        1
#define AVR32_SR_GM                                            16
#define AVR32_SR_GM_MASK                               0x00010000
#define AVR32_SR_GM_OFFSET                                     16
#define AVR32_SR_GM_SIZE                                        1
#define AVR32_SR_H                                             29
#define AVR32_SR_H_MASK                                0x20000000
#define AVR32_SR_H_OFFSET                                      29
#define AVR32_SR_H_SIZE                                         1
#define AVR32_SR_I0M                                           17
#define AVR32_SR_I0M_MASK                              0x00020000
#define AVR32_SR_I0M_OFFSET                                    17
#define AVR32_SR_I0M_SIZE                                       1
#define AVR32_SR_I1M                                           18
#define AVR32_SR_I1M_MASK                              0x00040000
#define AVR32_SR_I1M_OFFSET                                    18
#define AVR32_SR_I1M_SIZE                                       1
#define AVR32_SR_I2M                                           19
#define AVR32_SR_I2M_MASK                              0x00080000
#define AVR32_SR_I2M_OFFSET                                    19
#define AVR32_SR_I2M_SIZE                                       1
#define AVR32_SR_I3M                                           20
#define AVR32_SR_I3M_MASK                              0x00100000
#define AVR32_SR_I3M_OFFSET                                    20
#define AVR32_SR_I3M_SIZE                                       1
#define AVR32_SR_J                                             28
#define AVR32_SR_J_MASK                                0x10000000
#define AVR32_SR_J_OFFSET                                      28
#define AVR32_SR_J_SIZE                                         1
#define AVR32_SR_L                                              5
#define AVR32_SR_L_MASK                                0x00000020
#define AVR32_SR_L_OFFSET                                       5
#define AVR32_SR_L_SIZE                                         1
#define AVR32_SR_M                                             22
#define AVR32_SR_M_APP                                 0x00000000
#define AVR32_SR_M_EX                                  0x00000006
#define AVR32_SR_M_INT0                                0x00000002
#define AVR32_SR_M_INT1                                0x00000003
#define AVR32_SR_M_INT2                                0x00000004
#define AVR32_SR_M_INT3                                0x00000005
#define AVR32_SR_M_MASK                                0x01c00000
#define AVR32_SR_M_NMI                                 0x00000007
#define AVR32_SR_M_OFFSET                                      22
#define AVR32_SR_M_SIZE                                         3
#define AVR32_SR_M_SUP                                 0x00000001
#define AVR32_SR_N                                              2
#define AVR32_SR_N_MASK                                0x00000004
#define AVR32_SR_N_OFFSET                                       2
#define AVR32_SR_N_SIZE                                         1
#define AVR32_SR_Q                                              4
#define AVR32_SR_Q_MASK                                0x00000010
#define AVR32_SR_Q_OFFSET                                       4
#define AVR32_SR_Q_SIZE                                         1
#define AVR32_SR_R                                             15
#define AVR32_SR_R_MASK                                0x00008000
#define AVR32_SR_R_OFFSET                                      15
#define AVR32_SR_R_SIZE                                         1
#define AVR32_SR_T                                             14
#define AVR32_SR_T_MASK                                0x00004000
#define AVR32_SR_T_OFFSET                                      14
#define AVR32_SR_T_SIZE                                         1
#define AVR32_SR_V                                              3
#define AVR32_SR_V_MASK                                0x00000008
#define AVR32_SR_V_OFFSET                                       3
#define AVR32_SR_V_SIZE                                         1
#define AVR32_SR_Z                                              1
#define AVR32_SR_Z_MASK                                0x00000002
#define AVR32_SR_Z_OFFSET                                       1
#define AVR32_SR_Z_SIZE                                         1

#define AVR32_TLBEHI_ASID                                       0
#define AVR32_TLBEHI_ASID_MASK                         0x000000ff
#define AVR32_TLBEHI_ASID_OFFSET                                0
#define AVR32_TLBEHI_ASID_SIZE                                  8
#define AVR32_TLBEHI_I                                          8
#define AVR32_TLBEHI_I_MASK                            0x00000100
#define AVR32_TLBEHI_I_OFFSET                                   8
#define AVR32_TLBEHI_I_SIZE                                     1
#define AVR32_TLBEHI_V                                          9
#define AVR32_TLBEHI_VPN                                       10
#define AVR32_TLBEHI_VPN_MASK                          0xfffffc00
#define AVR32_TLBEHI_VPN_OFFSET                                10
#define AVR32_TLBEHI_VPN_SIZE                                  22
#define AVR32_TLBEHI_V_MASK                            0x00000200
#define AVR32_TLBEHI_V_OFFSET                                   9
#define AVR32_TLBEHI_V_SIZE                                     1

#define AVR32_TLBELO_AP                                         4
#define AVR32_TLBELO_AP_MASK                           0x00000070
#define AVR32_TLBELO_AP_OFFSET                                  4
#define AVR32_TLBELO_AP_PRIV_RWX_UNPRIV_NONE           0x00000003
#define AVR32_TLBELO_AP_PRIV_RWX_UNPRIV_RWX            0x00000007
#define AVR32_TLBELO_AP_PRIV_RW_UNPRIV_NONE            0x00000002
#define AVR32_TLBELO_AP_PRIV_RW_UNPRIV_RW              0x00000006
#define AVR32_TLBELO_AP_PRIV_RX_UNPRIV_NONE            0x00000001
#define AVR32_TLBELO_AP_PRIV_RX_UNPRIV_RX              0x00000005
#define AVR32_TLBELO_AP_PRIV_R_UNPRIV_NONE             0x00000000
#define AVR32_TLBELO_AP_PRIV_R_UNPRIV_R                0x00000004
#define AVR32_TLBELO_AP_SIZE                                    3
#define AVR32_TLBELO_B                                          7
#define AVR32_TLBELO_B_MASK                            0x00000080
#define AVR32_TLBELO_B_OFFSET                                   7
#define AVR32_TLBELO_B_SIZE                                     1
#define AVR32_TLBELO_C                                          9
#define AVR32_TLBELO_C_MASK                            0x00000200
#define AVR32_TLBELO_C_OFFSET                                   9
#define AVR32_TLBELO_C_SIZE                                     1
#define AVR32_TLBELO_D                                          1
#define AVR32_TLBELO_D_MASK                            0x00000002
#define AVR32_TLBELO_D_OFFSET                                   1
#define AVR32_TLBELO_D_SIZE                                     1
#define AVR32_TLBELO_G                                          8
#define AVR32_TLBELO_G_MASK                            0x00000100
#define AVR32_TLBELO_G_OFFSET                                   8
#define AVR32_TLBELO_G_SIZE                                     1
#define AVR32_TLBELO_PFN                                       10
#define AVR32_TLBELO_PFN_MASK                          0xfffffc00
#define AVR32_TLBELO_PFN_OFFSET                                10
#define AVR32_TLBELO_PFN_SIZE                                  22
#define AVR32_TLBELO_SZ                                         2
#define AVR32_TLBELO_SZ_1KB                            0x00000000
#define AVR32_TLBELO_SZ_1MB                            0x00000003
#define AVR32_TLBELO_SZ_4KB                            0x00000001
#define AVR32_TLBELO_SZ_64KB                           0x00000002
#define AVR32_TLBELO_SZ_MASK                           0x0000000c
#define AVR32_TLBELO_SZ_OFFSET                                  2
#define AVR32_TLBELO_SZ_SIZE                                    2
#define AVR32_TLBELO_W                                          0
#define AVR32_TLBELO_W_MASK                            0x00000001
#define AVR32_TLBELO_W_OFFSET                                   0
#define AVR32_TLBELO_W_SIZE                                     1

