vegarwe/avr32/common/include/avr32/ioavr32.h
#ifdef __IAR_SYSTEMS_ASM__

/**************************************************
 *   System registers
 **************************************************/

AVR32_SR        DEFINE  0x000
AVR32_EVBA      DEFINE  0x004
AVR32_ACBA      DEFINE  0x008
AVR32_CPUCR     DEFINE  0x00c
AVR32_ECR       DEFINE  0x010
AVR32_RSR_SUP   DEFINE  0x014
AVR32_RSR_INT0  DEFINE  0x018
AVR32_RSR_INT1  DEFINE  0x01c
AVR32_RSR_INT2  DEFINE  0x020
AVR32_RSR_INT3  DEFINE  0x024
AVR32_RSR_EX    DEFINE  0x028
AVR32_RSR_NMI   DEFINE  0x02c
AVR32_RSR_DBG   DEFINE  0x030
AVR32_RAR_SUP   DEFINE  0x034
AVR32_RAR_INT0  DEFINE  0x038
AVR32_RAR_INT1  DEFINE  0x03c
AVR32_RAR_INT2  DEFINE  0x040
AVR32_RAR_INT3  DEFINE  0x044
AVR32_RAR_EX    DEFINE  0x048
AVR32_RAR_NMI   DEFINE  0x04c
AVR32_RAR_DBG   DEFINE  0x050
AVR32_JECR      DEFINE  0x054
AVR32_JOSP      DEFINE  0x058
AVR32_JAVA_LV0  DEFINE  0x05c
AVR32_JAVA_LV1  DEFINE  0x060
AVR32_JAVA_LV2  DEFINE  0x064
AVR32_JAVA_LV3  DEFINE  0x068
AVR32_JAVA_LV4  DEFINE  0x06c
AVR32_JAVA_LV5  DEFINE  0x070
AVR32_JAVA_LV6  DEFINE  0x074
AVR32_JAVA_LV7  DEFINE  0x078
AVR32_JTBA      DEFINE  0x07c
AVR32_JBCR      DEFINE  0x080

AVR32_CONFIG0   DEFINE  0x100
AVR32_CONFIG1   DEFINE  0x104
AVR32_COUNT     DEFINE  0x108
AVR32_COMPARE   DEFINE  0x10c
AVR32_TLBEHI    DEFINE  0x110
AVR32_TLBELO    DEFINE  0x114
AVR32_PTBR      DEFINE  0x118
AVR32_TLBEAR    DEFINE  0x11c
AVR32_MMUCR     DEFINE  0x120
AVR32_TLBARLO   DEFINE  0x124
AVR32_TLBARHI   DEFINE  0x128
AVR32_PCCNT     DEFINE  0x12c
AVR32_PCNT0     DEFINE  0x130
AVR32_PCNT1     DEFINE  0x134
AVR32_PCCR      DEFINE  0x138
AVR32_BEAR      DEFINE  0x13c
AVR32_MPUAR0    DEFINE  0x140
AVR32_MPUAR1    DEFINE  0x144
AVR32_MPUAR2    DEFINE  0x148
AVR32_MPUAR3    DEFINE  0x14c
AVR32_MPUAR4    DEFINE  0x150
AVR32_MPUAR5    DEFINE  0x154
AVR32_MPUAR6    DEFINE  0x158
AVR32_MPUAR7    DEFINE  0x15c
AVR32_MPUPSR0   DEFINE  0x160
AVR32_MPUPSR1   DEFINE  0x164
AVR32_MPUPSR2   DEFINE  0x168
AVR32_MPUPSR3   DEFINE  0x16c
AVR32_MPUPSR4   DEFINE  0x170
AVR32_MPUPSR5   DEFINE  0x174
AVR32_MPUPSR6   DEFINE  0x178
AVR32_MPUPSR7   DEFINE  0x17c
AVR32_MPUCRA    DEFINE  0x180
AVR32_MPUCRB    DEFINE  0x184
AVR32_MPUBRA    DEFINE  0x188
AVR32_MPUBRB    DEFINE  0x18c
AVR32_MPUAPRA   DEFINE  0x190
AVR32_MPUAPRB   DEFINE  0x194
AVR32_MPUCR     DEFINE  0x198

#endif /* __IAR_SYSTEMS_ASM__*/

#endif /* __IOAVR32_H */
